#+title: clif: The common lisp interactive fiction system
#+AUTHOR: Fernando Raul Rodriguez Flores

#+TODO: HERE TODO | DONE

***** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ())

        (bformat t "testing initialize-undum. check /tmp/clif.html")
        (with-open-file (f "/tmp/clif.html" :direction :output
                           :if-exists :supersede)
          (initialize-undum t undum f)))
      #+end_src

      #+RESULTS:
      : ================================================
      :  testing initialize-undum. check /tmp/clif.html
      : ================================================
      : 

**** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((bs1 (basic-situation 'test1
                                   "hello world,"
                                   " my first situation"
                                   ", with 3 lines"))
             (bs2 (basic-situation 'test2
                                   "<h1>Un juego con una sola situación</h1>"
                                   "<p>Esta es una única situación, con texto.</p>."
                                   "<p>Presiona <a href='ultimo'>aquí para terminar...</a></p>")))
        (bformat t "testing generate-code for basic situation")
        (generate-code bs1 undum t)
        (terpri) (terpri)
        (generate-code bs2 undum t))
      #+end_src

      #+RESULTS:
      : <a href='START'>al comienzo otra vez...</a>

**** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (link "test1" "click here to go to 'test1"))
                (l2 (link "test2" :transient "click here to go to 'test2"))
                (l3 (link "test3" :transient "click here to go" " to 'test2" " with list"))
                (l4 (link "test4" :transient "click here to go" :another_class " to 'test2" " with list")))
        (bformat t "testing the code-generation for link")
        (generate-code l1 undum t) (terpri)
        (generate-code l2 undum t) (terpri)
        (generate-code l3 undum t) (terpri)
        (generate-code l4 undum t) (terpri))
      #+end_src

      #+RESULTS:
      : <a href='START'>al comienzo otra vez...</a>

***** test within a story to a file
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((bs1 (basic-situation "start"
                                   "<h1>Un juego con una sola situación</h1>"
                                   (nline)
                                   "<p>Esta es una única situación, con texto.</p>"
                                   (nline)
                                   "<p>Presiona " (link "ultimo" "aquí para terminar.") "</p>"))
             (bs2 (basic-situation "ultimo"
                                   "<p class='transient'>Felicitaciones</p>"
                                   (nline)
                                   "<p>Has terminado tu primera aventura</p>"
                                   (nline)
                                   "<p>FIN</p>"))
             (story1 (story (list bs1 bs2) "start")))

        (bformat t "testing generate-code to a file for a story")
        (with-open-file (f "/tmp/undum-game.js" :direction :output
                           :if-exists :supersede)
            (generate-code story1 undum f)))
      #+end_src

      #+RESULTS:
      : =============================================
      :  testing generate-code to a file for a story
      : =============================================
      : 

**** test v1
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (h1 "This is a test for a header"))
             (l2 (h1 "This is a test" " for a header" " with list as contents"))
             (l3 (h1 :transient "This is a test"))
             (l4 (h1 :transient "This is a test" :with_2_classes " with css-classes")))
        (bformat t "testing the constructor for h1")
        (generate-code l1 undum t)
        (terpri)
        (generate-code l2 undum t)
        (terpri)
        (generate-code l3 undum t)
        (terpri)
        (generate-code l4 undum t))
      #+end_src

      #+RESULTS:
      : <h1>This is a test for a header</h1>

**** test
      #+begin_src lisp :results output :export code :tangle src/tests.lisp
      (let* ((l1 (p "This is a test for a paragraph"))
             (l2 (p "This is a test" " for a paragraph" " with list as contents"))
             (l3 (p :transient "This is a test"))
             (l4 (p :transient "This is a test" :with_2_classes " with css-classes")))
        (bformat t "testing the code generation for <p>")
        (generate-code l1 undum t)
        (terpri)
        (generate-code l2 undum t)
        (terpri)
        (generate-code l3 undum t)
        (terpri)
        (generate-code l4 undum t))
      #+end_src

      #+RESULTS:
      : <h1>This is a test for a header</h1>


** test2 (using some html elements p and h1, with css-classes)
   #+begin_src lisp :results output :export code :tangle src/tests.lisp
   (let* (start
          last
          story1)
     (bformat t "testing a full story")
     (setf start (basic-situation
                  "start"
                  (h1 "A game with only one situation, but with h1 and p and css")
                  (nline)
                  (p "This is the only situation, with text.")
                  (nline)
                  (p :transient "And this should dissapear...  :-o")
                  (nline)
                  (p :transient "Click" (link "last"" here to end..."))))

     (setf last (basic-situation
                 "last"
                 (p "Congratulations.")
                  (nline)
                 (p "You finished your first adventure.")
                  (nline)
                 (p "THE END")))
     (setf story1 (story (list start last) "start"))
     (format t "~a~%" start)
     (format t "~a~%" last)
     (with-open-file (f "/tmp/undum-game.js"
                        :direction :output
                        :if-exists :supersede)
       (generate-code story1 undum f)))
   #+end_src

   #+RESULTS:
   #+begin_example
   ======================
    testing a full story
   ======================

   basicSituation (start): (<<H1 NIL: (A game with only one situation, but with h1 and p and css)>>
                            <<newline>>
                            <<p NIL: (This is the only situation, with text.)>>
                            <<newline>>
                            <<p (transient): (And this should dissapear...  :-o)>>
                            <<newline>>
                            <<p (transient): (Click
                                              <<link NIL to (last): ( here to end...)>>)>>)
   basicSituation (last): (<<p NIL: (Congratulations.)>> <<newline>>
                           <<p NIL: (You finished your first adventure.)>>
                           <<newline>> <<p NIL: (THE END)>>)
   #+end_example

